# 数组中占比超过一半的元素称之为主要元素。给定一个整数数组，找到它的主要元素。若没有，返回-1。 
# 
#  示例 1： 
# 
#  输入：[1,2,5,9,5,9,5,5,5]
# 输出：5 
# 
#  
# 
#  示例 2： 
# 
#  输入：[3,2]
# 输出：-1 
# 
#  
# 
#  示例 3： 
# 
#  输入：[2,2,1,1,1,2,2]
# 输出：2 
# 
#  
# 
#  说明： 
# 你有办法在时间复杂度为 O(N)，空间复杂度为 O(1) 内完成吗？ 
#  Related Topics 位运算 数组 分治算法 
#  👍 65 👎 0


# leetcode submit region begin(Prohibit modification and deletion)
class Solution:
    def majorityElement(self, nums: List[int]) -> int:
        # 投票法
        # 找出2个不同的数两两抵消，如果最后存在没有抵消的数，说明该数可能是众数
        # 如果存在众数，必定为major，因为总数个数大于 > n / 2, 所有major一定是众数。
        # 如果不存在众数，major可能是没参加抵消的漏网之鱼。
        # 例子：cnt > 0，但不存在众数7 5 5 5 3 2 8 6 9 9
        major, cnt = 0, 0
        for i in nums:
            if cnt == 0:
                major = i
                cnt += 1
            elif major == i:
                cnt += 1
            else:
                cnt -= 1

        if cnt > 0:
            t = 0
            for i in nums:
                if i == major:
                    t += 1
            if t > len(nums) // 2:
                return major
        return -1
# leetcode submit region end(Prohibit modification and deletion)
